Documents/ЗагрузкаАналогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗагрузкаАналогов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АналогиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПоиска</Name>
					<Comment>0 - авртикул, 1 - код</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварыСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураСтр</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бренд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БрендСтр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АналогиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>АналогиТоваров</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удалено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗагрузкаАналогов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Строка Из Товары Цикл
		Если ЗначениеЗаполнено(Строка.Бренд) И Не Строка.Номенклатура.Пустая() и Не ПустаяСтрока(Строка.Артикул) Тогда
			
			НовСтрока = Движения.АналогиТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
			НовСтрока.Период = Дата;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура Обновить_товарыСтр()
	
	Макс 		= Метаданные().Реквизиты.ТоварыСтр.Тип.КвалификаторыСтроки.Длина;
	текТовары 	= Новый Массив;
	Длина 		= 0;
	
	Для КАждого Строка Из Товары Цикл
		Имя = Строка.Номенклатура.Наименование;
		Если текТовары.Найти(Имя) = Неопределено Тогда
			Длина = Длина + СтрДлина(Имя);
			Если Длина > Макс Тогда
				текТовары.Добавить("...");
				Прервать;
			Иначе
				текТовары.Добавить(Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТоварыСтр = СтрСоединить(текТовары, ";");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Обновить_товарыСтр();
	
	Если Не ОбменДанными.Загрузка Тогда
		
		Если Автор.Пустая() Тогда 
			Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
	КонецЕсли;

КонецПроцедуры
